메타버스/CM_002/Main.yml
config:
  target: "https://komscoverse.kro.kr"
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 3
      arrivalRate: 100
      rampTo: 100
      name: Warm up phase
  plugins:
    ensure: {}
    apdex: {}
    metrics-by-endpoint: {}
  apdex:
    threshold: 100
  ensure:
    thresholds:
      - http.response_time.p99: 100
      - http.response_time.p95: 75

scenarios:
    - name: "Create user and log in"
      flow:
      - post:
          url: "/app/auth/usersignin"
          capture:
            - json: "$"
              as: response
      - get:
          url: "/app/main/public-world-join"
          headers:
            sessionToken: "{{response._sessionToken}}"
          capture:
            - json: "$"
              as: responseWorld
      - log: "DebugLog : {{responseWorld}}"